package umwoosung;
/*멤버변수(전역변수)-클래스내에서 사용할수있는 변수
 * 같은 클래스 내에 있더도 반듯이 한번은 선언해 쓸수있다.
 * 지역변수-클래스 내의 생성자에서만 쓸수있는 변수
 * 
 * ArrayList list;
 * 
 * list.add( )자동으로 0부터 들어간다.<<의 기본형?
 * 함수안에 함수가 들어갈수있는가?
 * 
 * for문의 시작과 종료.
 * for(int i = 0;i<10;i++)
 * 	   선언	범위		변수  	시작은 선언에서 범위로 시작하고 한번 돈후 변수가 적용되고
 * for문의 변수를 더한후 범위에서 종료된다.
 * 
 * Wrapper(래퍼)클래스. 데이터 타입을 좀더 기능을 쓸수있게 만든 클래스.
 * ex)int->Integer 
 * 
 * while(){
 * } - ()안의 값이 만족할때까지 돈다.
 *    a++;같은것으로 리턴해줘서 종료를 시켜줘야한다.
 *	++num  
 *	num++ 
 *
 * 재기호출 나자신을 호출한것.
 * while 메인에서 호출한것
 *
*/
